/**
 * 类应先声明后引用
 */

class Animal{
 
}
let a=new Animal();

//分割线=================================================
/**
 * 匿名类
 * 
 */
let b= class{
   constructor(name){
       this.name=name;
   }
}
console.log(b.name);
console.log('这是匿名类的分割线==========================');

//分割线=================================================
class Father{
    constructor(name){
        this.name=name;
    }
    say(){
        console.log('这是Father的say方法');
    }
    get says(){
        return this.say();
    }
}
const c=new Father();
console.log(c.say);
console.log(c.says);
console.log('这是原型方法分割线=================================');
//分割线=================================================

class Point {
    constructor(x, y) {
        this.x = x;
        this.y = y;
    }

    static distance(a, b) {
        const dx = a.x - b.x;
        const dy = a.y - b.y;

        return Math.hypot(dx, dy);
    }
}

const p1 = new Point(5, 5);
const p2 = new Point(10, 10);

console.log(Point.distance(p1, p2));
console.log('这是静态方法分割线=================================');
//分割线=================================================






//分割线=================================================
//分割线=================================================
//分割线=================================================
//分割线=================================================
//分割线=================================================
//分割线=================================================
//分割线=================================================
//分割线=================================================
//分割线=================================================
//分割线=================================================
